# Arithmetic Operations

In [1]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})

In [2]:
print(var)

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [10]:
var["C"] = var["A"] + var["B"]
var

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [11]:
var["C"] = var["A"] - var["B"]
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [12]:
var["C"] = var["A"] % var["B"]
var

   A  B  C
0  1  5  1
1  2  6  2
2  3  7  3
3  4  8  4

In [13]:
var["C"] = var["A"] * var["B"]
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [14]:
var["C"] = var["A"] / var["B"]
var

   A  B         C
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

In [21]:
var1 = pd.DataFrame({"A": [11,32,43,54,23], "S":[22,43,2,0,30]})
var1["Python"] = var1["A"] <= 30
print()
print(var1)

    A   S  Python
0  11  22    True
1  32  43   False
2  43   2   False
3  54   0   False
4  23  30    True

In [23]:
var2 = pd.DataFrame({"A": [11,32,43,54,23], "S":[22,43,2,0,30]})
var2["Python"] = var2["A"] >= 30
var2["Python_1"] = var2["S"] <=20
print()
print(var2)

    A   S  Python  Python_1
0  11  22   False     False
1  32  43    True     False
2  43   2    True      True
3  54   0    True      True
4  23  30   False     False